Revit 2024 API
FabricSheet.IsBent Property
 The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsBent { get; }
Visual Basic
Public ReadOnly Property IsBent As Boolean
	Get
Visual C++
public:
property bool IsBent {
	bool get ();
}
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace